const val maxCountPeoples = 30
const val minCountPeoples = 1

val tableFields = listOf(
    "Имя", "Фамилия", "Отчество", "Возраст","Пол", "Дата рождения", "Место рождения",
    "Индекс", "Страна", "Область", "Город", "Улица", "Дом", "Квартира"
)

val firstNamesMan = listOf(
    "Артём", "Александр", "Михаил", "Максим", "Иван",
    "Даниил", "Дмитрий", "Кирилл", "Никита", "Егор",
    "Андрей", "Владимир", "Сергей", "Павел", "Антон",
    "Роман", "Георгий", "Игорь", "Евгений", "Лев",
    "Василий", "Фёдор", "Тимофей", "Степан", "Виктор",
    "Григорий", "Юрий", "Олег", "Николай", "Виталий"
)

val firstNamesWoman = listOf(
    "Софья", "Анастасия", "Дарья", "Мария", "Анна",
    "Виктория", "Полина", "Елизавета", "Екатерина", "Ксения",
    "Алина", "Алиса", "Алла", "Альбина", "Амина",
    "Амира", "Анаис", "Ангелина", "Анжела", "Анжелика",
    "Анисия", "Антонина", "Анфиса", "Аполлинария", "Аполлония",
    "Арабелла", "Ариана", "Белла", "Валерия", "Варвара"
)

val lastNamesMan = listOf(
    "Иванов", "Смирнов", "Кузнецов", "Попов", "Васильев",
    "Петров", "Соколов", "Михайлов", "Новиков", "Фёдоров",
    "Морозов", "Волков", "Лебедев", "Козлов", "Зайцев",
    "Павлов", "Семёнов", "Голубев", "Богданов", "Воробьёв",
    "Беляев", "Тарасов", "Белов", "Комаров", "Орлов",
    "Макаров", "Андреев", "Ковалёв", "Ильин", "Гусев"
)

val lastNamesWoman = listOf(
    "Иванова", "Петрова", "Сидорова", "Кузнецова", "Смирнова",
    "Козлова", "Морозова", "Новикова", "Волкова", "Зайцева",
    "Павлова", "Соколова", "Михайлова", "Федорова", "Медведева",
    "Алексеева", "Казакова", "Никитина", "Белоусова", "Тарасова",
    "Белова", "Комарова", "Орлова", "Киселева", "Макарова",
    "Андреева", "Королева", "Гусева", "Киселева", "Тихонова"
)

val middleNamesMan = listOf(
    "Александрович", "Андреевич", "Аркадьевич", "Артёмович", "Борисович",
    "Вадимович", "Валерьевич", "Васильевич", "Викторович", "Витальевич",
    "Владимирович", "Вячеславович", "Геннадьевич", "Георгиевич",
    "Даниилович", "Денисович", "Дмитриевич", "Евгеньевич", "Иванович",
    "Игоревич", "Константинович", "Леонидович", "Максимович", "Матвеевич",
    "Михайлович", "Николаевич", "Олегович", "Павлович", "Петрович"

)
val middleNamesWoman = listOf(
    "Александровна", "Андреевна", "Аркадьевна", "Артёмовна", "Борисовна",
    "Вадимовна", "Валерьевна", "Васильевна", "Викторовна", "Витальевна",
    "Владимировна", "Вячеславовна", "Геннадьевна", "Георгиевна", "Данииловна",
    "Денисовна", "Дмитриевна", "Евгеньевна", "Ивановна", "Игоревна",
    "Константиновна", "Леонидовна", "Максимовна", "Матвеевна", "Михайловна",
    "Николаевна", "Олеговна", "Павловна", "Петровна"
)

const val nameCountry = "Россия"
const val male = "МУЖ"
const val female = "ЖЕН"
