import com.github.javafaker.Faker
import java.util.Locale

const val MAX_COUNT_PEOPLE = 30
const val MIN_COUNT_PEOPLE = 1

const val MIN_ZIP_CODE = 101000
const val MAX_ZIP_CODE = 692760

const val MIN_HOUSE_NUMBER = 1
const val MAX_HOUSE_NUMBER = 200

const val MIN_APARTMENT_NUMBER = 1
const val MAX_APARTMENT_NUMBER = 500

const val NAME_COUNTRY = "Россия"

const val DATE_FORMAT = "dd-MM-yyyy"

val FAKE = Faker(Locale("ru_RU"))

const val MALE = "МУЖ"
const val FEMALE = "ЖЕН"

const val MAX_AGE = 80
const val MIN_AGE = 18

const val PAGE_WIDTH = 100f
const val PATH_FONT = "src/main/resources/fonts/arial.ttf"
const val FONT_SIZE = 4f

const val FILE_NAME_PDF = "people.pdf"

val TABLE_FIELD_NAMES = listOf(
    "Имя", "Фамилия", "Отчество", "Возраст","Пол", "Дата рождения", "Место рождения",
    "Индекс", "Страна", "Область", "Город", "Улица", "Дом", "Квартира"
)

val FIRST_NAMES_MAN = listOf(
    "Артём", "Александр", "Михаил", "Максим", "Иван",
    "Даниил", "Дмитрий", "Кирилл", "Никита", "Егор",
    "Андрей", "Владимир", "Сергей", "Павел", "Антон",
    "Роман", "Георгий", "Игорь", "Евгений", "Лев",
    "Василий", "Фёдор", "Тимофей", "Степан", "Виктор",
    "Григорий", "Юрий", "Олег", "Николай", "Виталий"
)

val FIRST_NAMES_WOMAN = listOf(
    "Софья", "Анастасия", "Дарья", "Мария", "Анна",
    "Виктория", "Полина", "Елизавета", "Екатерина", "Ксения",
    "Алина", "Алиса", "Алла", "Альбина", "Амина",
    "Амира", "Анаис", "Ангелина", "Анжела", "Анжелика",
    "Анисия", "Антонина", "Анфиса", "Аполлинария", "Аполлония",
    "Арабелла", "Ариана", "Белла", "Валерия", "Варвара"
)

val LAST_NAMES_MAN = listOf(
    "Иванов", "Смирнов", "Кузнецов", "Попов", "Васильев",
    "Петров", "Соколов", "Михайлов", "Новиков", "Фёдоров",
    "Морозов", "Волков", "Лебедев", "Козлов", "Зайцев",
    "Павлов", "Семёнов", "Голубев", "Богданов", "Воробьёв",
    "Беляев", "Тарасов", "Белов", "Комаров", "Орлов",
    "Макаров", "Андреев", "Ковалёв", "Ильин", "Гусев"
)

val LAST_NAMES_WOMAN = listOf(
    "Иванова", "Петрова", "Сидорова", "Кузнецова", "Смирнова",
    "Козлова", "Морозова", "Новикова", "Волкова", "Зайцева",
    "Павлова", "Соколова", "Михайлова", "Федорова", "Медведева",
    "Алексеева", "Казакова", "Никитина", "Белоусова", "Тарасова",
    "Белова", "Комарова", "Орлова", "Киселева", "Макарова",
    "Андреева", "Королева", "Гусева", "Киселева", "Тихонова"
)

val MIDDLE_NAMES_MAN = listOf(
    "Александрович", "Андреевич", "Аркадьевич", "Артёмович", "Борисович",
    "Вадимович", "Валерьевич", "Васильевич", "Викторович", "Витальевич",
    "Владимирович", "Вячеславович", "Геннадьевич", "Георгиевич",
    "Даниилович", "Денисович", "Дмитриевич", "Евгеньевич", "Иванович",
    "Игоревич", "Константинович", "Леонидович", "Максимович", "Матвеевич",
    "Михайлович", "Николаевич", "Олегович", "Павлович", "Петрович"
)

val MIDDLE_NAMES_WOMAN = listOf(
    "Александровна", "Андреевна", "Аркадьевна", "Артёмовна", "Борисовна",
    "Вадимовна", "Валерьевна", "Васильевна", "Викторовна", "Витальевна",
    "Владимировна", "Вячеславовна", "Геннадьевна", "Георгиевна", "Данииловна",
    "Денисовна", "Дмитриевна", "Евгеньевна", "Ивановна", "Игоревна",
    "Константиновна", "Леонидовна", "Максимовна", "Матвеевна", "Михайловна",
    "Николаевна", "Олеговна", "Павловна", "Петровна"
)

val REGION_NAMES = listOf(
    "Амурская", "Архангельская", "Астраханская", "Белгородская", "Брянская",
    "Владимирская", "Волгоградская", "Вологодская", "Воронежская", "Ивановская",
    "Иркутская", "Калининградская", "Калужская", "Кемеровская", "Кировская",
    "Костромская", "Курганская", "Курская", "Ленинградская", "Липецкая",
    "Магаданская", "Московская", "Мурманская", "Нижегородская", "Новгородская",
    "Новосибирская", "Омская", "Оренбургская", "Орловская", "Пензенская",
    "Псковская", "Ростовская", "Рязанская", "Самарская", "Саратовская",
    "Сахалинская", "Свердловская", "Смоленская", "Тамбовская", "Тверская",
    "Томская", "Тульская", "Тюменская", "Ульяновская", "Челябинская",
    "Ярославская"
)

val STREET_NAMES = listOf(
    "Ленина", "Центральная", "Пушкина", "Советская", "Кирова",
    "Мира", "Школьная", "Красная", "Гагарина", "Садовая",
    "Новая", "Первомайская", "Строителей", "Солнечная", "Юбилейная",
    "Набережная", "Комсомольская", "Зеленая", "Северная", "Горького",
    "Молодежная", "Сосновая", "Октябрьская", "Заречная", "Ново-Садовая",
    "Мичурина", "Парковая", "Октябрьская", "Лесная", "Ленинградская",
    "Грушевская", "Заводская", "Свободы", "Колхозная", "Дружбы",
    "Комарова", "Калинина", "Рабочая", "Луговая", "Гоголя",
    "Маяковского", "Победы", "Заря", "Трудовая", "Восточная",
    "Фрунзе", "Маркса", "Сергеевская", "Пионерская", "Крылова",
    "Кировская", "Герцена", "Шоссейная", "Береговая", "Толстого",
    "Дачная", "Шевченко", "Ломоносова", "Лермонтова", "Совхозная",
    "Мичуринская", "Ключевая", "Полевая", "Бульварная", "Некрасова",
    "Фадеева", "Вокзальная", "Московская", "Котовского", "Театральная",
    "Свердлова", "Радищева", "Терешковой", "Гайдара", "Никитина",
    "Кутузова", "Пушкинская", "Халтурина", "Дзержинского", "Горная",
    "Спортивная", "Жукова", "Красноармейская", "Орджоникидзе"
)
